[
   {

   },
   {
      "title":"Palimpsest",
      "background":"./images/palimpsest/bg.jpg",
      "thumbnail":"../images/palimpsest/tn.jpg",
      "design":"iOS App design + Prototyping",
      "time":"2017 Spring",
      "responsibility": "Individual project",
      "type": "School project",
      "skills": "Adobe Creative Cloud, Swift",
      "final": "3 App design and prototypes",
      "concept":["The final product of the project is three different mobile apps and related parts like website and backend server. For the first step of the project, I completed interface design for each app, interactive mockups and prototypes and functional prototypes. Each app has its own focus and they all serve as a platform for fandom communities to communicate, create artworks and stories and collaborate.",
      "<span style='font-size:20px; line-height:28px; color:rgb(255,185,185);'>Comet Storybook</span>",
      "The idea of comet storybook came from the nature of fandom when I was watching my favorite TV show, Friends, again and again. And this thought always came to me. How would the story be like if Monica married Joey at last? What if Rachel didn’t leave Barry at the alter at the beginning? I have heard a lot about fanfiction but I hadn’t read them before I started reading fan fictions of Friends. sometimes I still have this feeling that I would change a little here and there or that I don’t like how things go like this. Thus, this idea of writing fan fictions of another fan fiction came to my mind and that’s how I wanted to create Comet Storybook.",
      "With this app, users can rewrite stories, change how to push forward the plot and read (perhaps) hundreds of different endings to one story. This structure of making stories makes it easier for amateur writers because they don’t really need to have a complete outline of a story. They can just start a story or change a little bit how things would go and let other writers finish it. This collaboration also creates a mystery for every writer because no one would know how the story would end. In terms of story readers, they can also choose different paths and see how the story goes. So instead of reading just one story, the reader can actually read multiple different stories.",
      "The app would also have a rating system for users to choose which is the best storyline. Users can also follow their favorite writers and check out the most popular stories.",
      "<a style='font-size:16px; line-height:28px; color:rgb(255,100,100);' href='https://invis.io/8AC3EFHVJ' target='view_window'>Try Comet prototype on InVision</a>",
      "<span style='font-size:20px; line-height:28px; color:rgb(255,185,185);'>Ocean Role Playing Game</span>",
      "Have you ever imagined if you become Harry Potter? Sheldon Cooper? Or Wolverine? What would you do when you’re facing the problems and what you would say to other characters? Ocean Role Playing Game is an app for fans to play their favorite characters, choose their paths and make up stories. This idea was based on some common fan activities like cosplay or theme gala. These kind of fan activities bring fans of the same interest together no matter where they come from and what gender they are. It’s a very important part of fan culture so I decided to bring that feature to the app where fans can gather around and collaborate.",
      "Also, when reading the scripts of a movie or a TV show, the most important part is the conversation between the characters. But when reading traditional stories, the conversations can be interesting, and some of them have distinguishing tones. However, they are still from one writer. But with this app, every game player will only need to talk as one character, which would make it easier for every collaborator and make the conversation not interesting.",
         "<a style='font-size:16px; line-height:28px; color:rgb(255,100,100);' href='https://invis.io/NCC3FTEKQ' target='view_window'>Try Ocean prototype on InVision</a>",
         "<span style='font-size:20px; line-height:28px; color:rgb(255,185,185);'>Echo Fan Art</span>",
      "This app is a platform for artists, fan communities to share their fan art works, mostly pictures but also videos and music. The platform would mainly focus on fan art so artists can use that platform to gain reputation in the specific communities and to advertise their works. Users can also use this app to follow artists, their interests and their favorite characters. This platform would be an archive for fan art works and well organized specifically for fan arts.",
      "I’m designing this App mainly because I think fan arts should be respected and shared. Fan arts sometimes have very dynamic views. I think fan art is also a way of telling a fan fiction because artists would draw something like Spock and Kirk making out and Harry Potter becoming a powerful little girl, we can see characters having different races, sexualities and genders. And it’s a visual way of expressing their thoughts.",
         "<a style='font-size:16px; line-height:28px; color:rgb(255,100,100);' href='https://invis.io/MCC3GC78P' target='view_window'>Try Echo prototype on InVision</a>"],
      "gallery":["../images/palimpsest/1.jpg","../images/palimpsest/2.jpg","../images/palimpsest/3.jpg","../images/palimpsest/4.png"],
      "video":"https://www.youtube.com/embed/zOtXhishv9U",
      "github":"https://github.com/LucienHuang/Comet"
   },
   {
      "title":"Infinite Dreams",
      "background":"./images/infinitedreams/bg.jpg",
      "thumbnail":"../images/infinitedreams/tn.gif",
      "design":"Installation+Creative coding",
      "time":"2016 Winter",
      "responsibility": "Individual project",
      "type": "School project",
      "skills": "OpenFrameworks, C++, Leap Motion, woodwork",
      "final": "An installation including a screen-based program and a physical object",
      "concept":["This project will explore the boundary between virtual world and real world. I want to come up with a new way of escapism that is for people to escape from their own problems in their real lives, but I also want to let my audience think of the importance of reality and dream, to keep a balance between the two worlds. Moreover, I want to recreate this dream-like experience to “dream consciously”. It will not only be an inspiring and impressive experience for the audience to engage so that the audience can get relief from their real problems, but the audience will also be able to have some deeper thoughts after the experience about dreaming and escapism. ",
         "<span style='font-size:20px; line-height:28px; color:rgb(255,185,185);'>Infinity and \"zero\"</span>",
         "Apart from the cool visual effects I want to create inside the box, I will also create a hollow and pale after-experience to make it a big contrast between the inside and outside of the box. When the audience looks at some really fascinating animation inside the box, the outside looks duller. Mirrors will be used to explain the symbol of “infinity”. Because dreams are so beautiful at first sight, but if someone lives in the dream and keeps dreaming for too long, he/she can only see the infinite hollowness and although it’s “infinity”, it’s really a “zero”. I want to use this project to express some of my thoughts about dreaming infinitely. Sometimes I think that dreams represent the things we want in our lives. But the more we drown in the dreams, the more we enjoy being in the dreams and not get out, and the more we drift apart from reality, from what really matters to us. Although we feel having everything we want in our dreams without paying any efforts, we don’t see the hollowness and the emptiness behind.",
         "It’s also a very interesting concept if we see the virtual world as an infinity number. We see everything in the dreams. There’s nothing we cannot see as long as we are imaginative enough. So is we see the virtual world as infinity, what will the world be itself? It’s actually a zero. Because There are infinite positive numbers, and for each positive number, there is a negative number matching with it. For example, -1 matches 1, and -2 matches 2. So if we sum all the positive numbers with all negative numbers, then the total combination of all in question would sum up to zero. And that is how void the virtual world is if nothing is missed there.",
         "<span style='font-size:20px; line-height:28px; color:rgb(255,185,185);'>Consciousness</span>",
         "Consciousness plays an important part in the interaction. When I’m dreaming, I usually have conscious emotions and real feelings, but it’s usually hard to tell whether it’s dream or real. So it’s hard to say if it’s really consciousness that we have when dreaming or if it’s just illusion. But since it’s impossible to use brain waves to interact due to the limit of budget and technology, I plan to let my audience to use his/her hands to interact. I will use hand interaction to concretize this abstract concept of consciousness.",
         "<span style='font-size:20px; line-height:28px; color:rgb(255,185,185);'>Dream Scenarios</span>",
         "<div class='small-videos'><iframe width='29%' height='100%' frameborder='0' src='https://www.youtube.com/embed/eIWlm4P3M8o?showinfo=0' allowfullscreen></iframe><iframe width='29%' height='100%' frameborder='0' src='https://www.youtube.com/embed/HD-OLJOYKVc?showinfo=0' allowfullscreen></iframe><iframe width='29%' height='100%' frameborder='0' src='https://www.youtube.com/embed/Ydlv6bO5QmE?showinfo=0' allowfullscreen></iframe></div>"],
      "gallery":["../images/infinitedreams/1.jpg","../images/infinitedreams/2.jpg","../images/infinitedreams/3.jpg","../images/infinitedreams/4.jpg","../images/infinitedreams/5.jpg","../images/infinitedreams/6.jpg","../images/infinitedreams/7.jpg","../images/infinitedreams/8.jpg","../images/infinitedreams/9.jpg","../images/infinitedreams/10.jpg","../images/infinitedreams/11.jpg","../images/infinitedreams/12.jpg","../images/infinitedreams/13.jpg","../images/infinitedreams/14.jpg"],
      "video":"https://www.youtube.com/embed/yxWuxK3HoyM",
      "github":"https://github.com/LucienHuang/Infinite-Dreams---Alice-Bounce"
   },
   {
      "title":"Lumière",
      "background":"./images/lumiere/bg.jpg",
      "thumbnail":"../images/lumiere/tn.gif",
      "design":"Physical computing",
      "time":"2016 Winter",
      "responsibility": "Individual project",
      "type": "Physical computing final project",
      "skills": "Arduino, crafting",
      "final": "A physical object using Arduino as a controller",
      "concept":["This project is based on Arduino. The object is a cubic lamp that generates changing lights that gives different feelings. There is no button on the lamp and the user can rotate the lamp to interact with it. If the lamp is rotated clockwise, it can be turned on. And if it's rotated anti-clockwise, it can be turned off. When the lamp is on, rotating it clockwise again can change the light mode of the lamp. Also, when the lamp is landed on different planes, the lighting mode will be different. Since the cube has 6 planes, it has 6 modes of light, namely, Fire, Chroma, Wave, Heartbeat, Rainbow and Star. In every mode, there are also 4 different lighting color mode and speed mode.",
            "I used a DotStar LED strip and an accelerometer to realize the interaction."],
      "gallery":["../images/lumiere/1.jpg","../images/lumiere/2.jpg","../images/lumiere/3.jpg","../images/lumiere/4.jpg","../images/lumiere/5.jpg","../images/lumiere/6.gif"],
      "video":"https://www.youtube.com/embed/vu8BOvXof2s",
      "github": "https://github.com/LucienHuang/Lumiere/blob/master/_16.12.10_Final_2.ino"
   },
   {
      "title":"Taskloud",
      "background":"../images/taskloud/bg.jpg",
      "thumbnail":"../images/taskloud/tn.jpg",
      "design":"iOS App",
      "time":"2016 Spring",
      "responsibility": "Individual project",
      "type": "Bachelor Degree Thesis",
      "skills": "Adobe Creative Cloud, Objective-C, MySQL, Node.js",
      "final": "A schedule planner APP based on iOS, related server-side program and project documentation",
      "concept":["Since working and Studying has been playing the most important role in our lives, we have to deal with a great deal of various affairs everyday. Scheduling time more appropriately is very essential to us. Therefore, I developed this easy-to-use APP to manage our time and schdules which can meet our daily needs. But the existing APPs are usually too complicated for users to use and they don't really maximum the advantage of smart phone.",
         "In this project, my intention is to develop an application which has a featur that allows users to manage others' schedule like adding new appointments. And I also used GPS in the application to let users get notification according to their position"],
      "gallery":["../images/taskloud/1.jpg","../images/taskloud/2.jpg","../images/taskloud/3.jpg","../images/taskloud/4.jpg"],
      "video":"https://www.youtube.com/embed/G29Oepm6Z5M?rel=0&amp;showinfo=0"
   },
   {
      "title":"Light Up",
      "background":"./images/lightup/bg.jpg",
      "thumbnail":"../images/lightup/tn.jpg",
      "design":"iOS App",
      "time":"2015 Summer",
      "responsibility": "Team leader / UI&UX designer / Programmer",
      "type": "Shanghai College Student Innovation Program - Excellent Project Award Winner",
      "skills": "Adobe Creative Cloud, Objective-C, MySQL, PHP, Baidu Maps API",
      "final": "A social travel APP based on iOS, related server-side program and project documentation.",
      "concept":["Sometimes we think we know a lot about the cities we live in. But actually, there are still some places that we've never been to in the cities. They can be really surprising, different and fascinating. During the time I live and study in Shanghai, I went to a lot of places and every time I went to a new place, I felt that I knew the city better. I didn't realize that Shanghai has so many different cultures. Some places are very flourishing, some are old, some are artistic... But they are all special and they make the city Shanghai. So I want to encourage people to go out, to know the city's culture and to seek the beauty of the city."
      ,"So the way I wanted to push people was to make an App. Since I noticed that people are more and more relying on mobile applications and they like to share and \"compete\" with their friends. Also, a mobile application can better track where the user has or has not been to. So we built a server and an application to realize the idea."
      ,"The first thing we did was summing up the requirements of users and functions the app should have. using this app, users can explore the city by lighting up the map, which is just like how exploration is like in computer games. And users can know where they have been to and how much percentage of the city they have explored. Also, users can share their experience, feelings and comments on certain places with other people so that they can read the comments and decide where they want to go. Users need to light up the position by taking a picture, and the system knows where they are according to their GPS information."
      ,"We had a really hard time developing the algorithm of dividing the city map. Because there are some places that are more touristy, and some more boring and unworthy of traveling to. The first idea was to dividing the map in irregular shapes. But it was impossible to store the shapes and to determine which area the users were in. Then, we decided to use circles because we could just store the position of the center and the radius to determine an area, which was a really good solution. And the reason why we just made the map of Shanghai was that it took a lot of time for us to draw on the map and to record the information of each area manually."
      ,"The project had some flaws. We could spend more time thinking about how to divide the map automatically because the dividing was too subject."],
      "gallery":["../images/lightup/1.jpg","../images/lightup/2.jpg","../images/lightup/3.jpg"],
      "video":"https://www.youtube.com/embed/YRxUPcOOzkg?rel=0&amp;showinfo=0"
   },
   {
      "title":"Jam!®",
      "background":"./images/jam/bg.jpg",
      "thumbnail":"../images/jam/tn.jpg",
      "design":"iOS App design + Prototyping",
      "time":"2017 Spring",
      "responsibility": "Interface designer / Programmer",
      "type": "School project",
      "skills": "Adobe Creative Cloud, Swift, Google Maps API",
      "final": "A social travel APP based on iOS, related server-side program and project documentation.",
      "concept":["Sometimes we think we know a lot about the cities we live in. But actually, there are still some places that we've never been to in the cities. They can be really surprising, different and fascinating. During the time I live and study in Shanghai, I went to a lot of places and every time I went to a new place, I felt that I knew the city better. I didn't realize that Shanghai has so many different cultures. Some places are very flourishing, some are old, some are artistic... But they are all special and they make the city Shanghai. So I want to encourage people to go out, to know the city's culture and to seek the beauty of the city."
      ,"So the way I wanted to push people was to make an App. Since I noticed that people are more and more relying on mobile applications and they like to share and \"compete\" with their friends. Also, a mobile application can better track where the user has or has not been to. So we built a server and an application to realize the idea."
      ,"The first thing we did was summing up the requirements of users and functions the app should have. using this app, users can explore the city by lighting up the map, which is just like how exploration is like in computer games. And users can know where they have been to and how much percentage of the city they have explored. Also, users can share their experience, feelings and comments on certain places with other people so that they can read the comments and decide where they want to go. Users need to light up the position by taking a picture, and the system knows where they are according to their GPS information."
      ,"We had a really hard time developing the algorithm of dividing the city map. Because there are some places that are more touristy, and some more boring and unworthy of traveling to. The first idea was to dividing the map in irregular shapes. But it was impossible to store the shapes and to determine which area the users were in. Then, we decided to use circles because we could just store the position of the center and the radius to determine an area, which was a really good solution. And the reason why we just made the map of Shanghai was that it took a lot of time for us to draw on the map and to record the information of each area manually."
      ,"The project had some flaws. We could spend more time thinking about how to divide the map automatically because the dividing was too subject."],
      "gallery":["../images/jam/1.jpg","../images/jam/2.jpg","../images/jam/3.jpg"],
      "video":"https://www.youtube.com/embed/iME-yT5suAA?rel=0&amp;showinfo=0",
      "github": "https://github.com/LucienHuang/TheJamApp"
   },
   {
      "title":"Green Funeral",
      "background":"./images/greenfuneral/bg.jpg",
      "thumbnail":"../images/greenfuneral/tn.jpg",
      "design":"Physical computing",
      "time":"2016 Fall",
      "responsibility": "Individual project",
      "type": "Physical Computing Midterm Project",
      "skills": "Arduino, Crafting",
      "final": "A phydical object",
      "concept":["This is a physical object project based on Arduino. The main idea is that since the environmental damage is getting worse, there are less and less green plants existing because of global warming and damage to forests. And may be some day in the near future, no green plants can survive. But it seems that only a few people worry about these issues. For some people, they don't care about the environment. They don't need green plants because they can just sit at home or at work, looking at this vivid moving \"plant\". So I made this project as sarcasm to arouse people's attention to the nature and to let them know what will happen if we keep doing damage to the nature."
         ,"In this project, I used 3 hall effect sensors, 10 LEDs in different colors, a continuous rotating servo and a ultrasonic distance sensor. There are in total 4 modes of this object. If 3 magnets are all face to the body, its the sleep mode which means the it's turned off. Pease mode is that lights glow gently and give out a peaceful feeling. Party mode is that the lights glow and blink fast, the servo rotates really fast which makes the body ratates. And Pet mode is that lights blink in random brightness. And if there's something blocking the ultrasonic sensor, the body will \"turn away\" like a pet to interact with its owner"
         ],
      "gallery":["../images/greenfuneral/1.jpg","../images/greenfuneral/2.jpg","../images/greenfuneral/3.jpg","../images/greenfuneral/4.jpg","../images/greenfuneral/5.jpg","../images/greenfuneral/6.jpg","../images/greenfuneral/7.jpg"],
      "video":"https://www.youtube.com/embed/fGDKFc9uSjQ?rel=0&amp;showinfo=0",
      "github": "https://github.com/LucienHuang/Green-Funeral/blob/master/midTerm.ino"
   },
   {
      "title":"Inside Out",
      "design":"Installation",
      "background":"./images/insideout/bg.jpg",
      "thumbnail":"../images/insideout/tn.jpg",
      "time":"2016 Fall",
      "responsibility": "Group project",
      "type": "Instruction sets",
      "skills": "Craft",
      "final": "An installation which allows children to interact with",
      "concept":["The topic for this project is instruction sets. So we were supposed to set up an interactive installation in a public place and observe how people interact with it. The outcome was quite successful and the result reached our expectations. At first, we wanted to use some AR techniques to let people look at the world differently. But then, we thought \"why don't we make some glasses or goggles so it would be different for users to look when they are wearing them?\" And that's when the final idea came up. But when we tested drawing something on a pair of glasses and looking through them, it was impossible to see both drawings on the glasses and the view outside because the drawings were too close to our eyes. So we changed our ideas to making cube helmets.",
      "We set up a few cubes and hanged them on the trees. The cubes were designed so that people can put their heads inside and look at the outside. The cubes are designed differently so that it would be different experiences for children to look."],
      "gallery":["../images/insideout/1.jpg","../images/insideout/2.jpg","../images/insideout/3.jpg","../images/insideout/4.jpg","../images/insideout/5.jpg"],
      "video":"https://www.youtube.com/embed/gZZr-CjkUGI?rel=0&amp;showinfo=0"
   },
   {
      "title":"Swerdz",
      "design":"Online chat room",
      "background":"./images/swerdz/bg.jpg",
      "thumbnail":"../images/swerdz/tn.jpg",
      "time":"2017 Spring",
      "responsibility": "Developer",
      "type": "School project",
      "skills": "Node.js, JavaScript, Socket.io, Google natual language API",
      "final": "A chat room that keep record of words that users have put in and convert the words into other words using the same syntax",
      "concept":["This project aimed to discuss the disconnection when people communicate with each other using technologies. And we exaggerated the disconnection to see whether people enjoy communicating with others with words that make sense or they can enjoy it even when they can't really understand each other.",
         "In this chat room, the system allows users to chat with each other. But their sentences will be modified and become sentences that are nonsense. The chatting will also be pronounced in different accent. Besides, the system stores all the words in the database, categorized into different word types. In the chat room, all the words will be replaced by the words in the same category. But the problem is that most of the time, the sentences don't make much sense."],
      "gallery":["../images/swerdz/1.jpg","../images/swerdz/2.jpg","../images/swerdz/3.jpg","../images/swerdz/4.jpg","../images/swerdz/5.jpg"],
      "github": "https://github.com/LucienHuang/Swerdz"
   },
   {
      "title":"postCard",
      "background":"./images/postcard/bg.jpg",
      "thumbnail":"../images/postcard/tn.jpg",
      "design":"Mobile Game Design",
      "time":"2017 Spring",
      "responsibility": "Individual project",
      "type": "School project",
      "skills": "Adobe CC, MarvelApp",
      "final": "A game experience design prototype",
      "concept":["Are people already tired of sending postcards to their friends and family? If so, why do we still want to do that in this digital world? I’m designing this game, postCard, to simulate the experience of sending a postcard. The main point of the game is to improve people’s connection with each other, their old friends and family. Users can collect different postcards when they travel around the world.  When users receive postCards from their friends, they can see how the postCard traveled around the world and arrived in their hands. And they can go to offline stores to print out the postCards so that they can have a physical thing to keep as a souvenir.",
         "<span style='font-size:20px; line-height:28px; color:rgb(255,185,185);'>User responsibilities</span>",
         "Collector: users can collect rare postCards by scanning the postStickers around the world. They can also buy postcards in postStations.",
         "Postman: When users want to send postCards, they have to work a little to as a payment of mailing the postCards.",
         "Designer: Users can design their unique postCards by taking pictures or using digital files. They can also sell their designs in the postStations but they will have to pay a little money at first before they can make profits.",
         "<span style='font-size:20px; line-height:28px; color:rgb(255,185,185);'>Business model</span>",
         "The game is free. But users need to pay when they want to buy postCards or print out postCards. They will also need to pay if they want their design to be sold in the postStations. But at the same time, they will make profits when their design is bought by others. On the other hand, if one wants to buy postCards, he will need to pay.",
         "Users can also earn game points to pay for other stuff like stamps, postMarks and they can also use game points to pay for sending the postCards. Users can earn game points by help others send postCards, working like postmen.",
         "<span style='font-size:20px; line-height:28px; color:rgb(255,185,185);'>Prototype</span>",
         "<a href='https://marvelapp.com/project/1746322/' style='color: rgb(255,100,100); font-size: 18px;' target='view_window'>MarvelApp</a>"
      ],
      "gallery":["../images/postcard/1.jpg","../images/postcard/2.jpg","../images/postcard/3.jpg","../images/postcard/4.jpg"],
      "video":"https://www.youtube.com/embed/cr2QgEClKhU"
   },
   {
      "title":"Cannon Man",
      "design":"Game",
      "background":"./images/cannonman/bg.jpg",
      "thumbnail":"../images/cannonman/tn.jpg",
      "time":"2015 Spring"
   },
   {
      "title":"EQueue",
      "design":"iOS App",
      "background":"./images/equeue/bg.jpg",
      "thumbnail":"../images/equeue/tn.jpg",
      "time":"2014 Winter"
   },
   {
      "title":"Compile Youth",
      "background":"./images/compileyouth/bg.jpg",
      "thumbnail":"../images/compileyouth/tn.jpg",
      "design":"Physical book",
      "time":"2016 Summer",
      "responsibility": "Designer",
      "type": "School yearbook",
      "skills": "Adobe Creative Cloud",
      "final": "Printed book",
      "concept":["This is the yearbook for students graduated from School of Software Engineering, Tongji University in 2016 and faculties."
      ,""],
      "gallery":["../images/compileyouth/1.jpg","../images/compileyouth/2.jpg","../images/compileyouth/3.jpg","../images/compileyouth/4.jpg"]
   },
   {
      "title":"Emoji Bot",
      "design":"Twitter Bot",
      "background":"./images/emojibot/bg.jpg",
      "thumbnail":"../images/emojibot/tn.jpg",
      "time":"2017 Spring",
      "responsibility": "Developer",
      "type": "School project",
      "skills": "Node.js, JavaScript, Twitter API, affectiva API, Socket.io",
      "final": "A Twitter Bot running with a website",
      "concept":["We began this project by first formulating an issue that we felt inspired to address. We are looking at the many cases where technology is collecting seemingly random bits of information and exposing this practice as an invasion of our privacy whether we cognizant of it or not. We decided that we needed a method to display it in a public environment to embellish on growing awareness of this disregard for our privacy. Thus, the (invasive) “Privacy Twitter Bot” was conceived. We have created a platform that can run in the background on your web browser while recording your facial expressions as you use your computer. The information that is taken will then convert into an emoticon or emoji and post it to twitter every second. This stream of posts will allow anyone who follows the Privacy Twitter Bot to know how the user is feeling as they go about their work, education, or recreational use of their time at a computer. ",
         "<a href='https://twitter.com/PrivateDataBot' style='color: rgb(255,100,100); font-size: 18px;' target='view_window'>View the twitterbot here</a>"],
      "gallery":["../images/emojibot/1.jpg","../images/emojibot/2.jpg","../images/emojibot/3.jpg"],
      "github": "https://github.com/LucienHuang/PrivacyTwitterBot"
   },
   {
      "title":"Light Eater",
      "design":"Physical computing",
      "background":"./images/lighteater/bg.jpg",
      "thumbnail":"../images/lighteater/tn.jpg",
      "time":"2014 Winter"
   }
]